app/controllers/images_controller.rb

SELECT "images".* FROM "images" WHERE "images"."occasion_id" = ?  [["occasion_id", 2]]
---
  def index
    if (params[:occasion] && Occasion.all.collect(&:name).include?(params[:occasion][:name]))
      # p "***************************"
      # p occa = (params[:occasion][:name])
      # p o = Occasion.where(name: occa )
      # p id = o[0].id
      # @id = Occasion.where(name: (params[:occasion][:name]) ).id
      # p @id
      @images = Image.where(occasion_id: id)