app/controllers/images_controller.rb

  def index
    # o returns true if occasion params exists and contains the name
    o = (params[:occasion] && Occasion.all.collect(&:name).include?(params[:occasion][:name]))
    # e returns true if ethnicity params exists and contains the name in the url
    e = (params[:ethnicity] && Ethnicity.all.collect(&:name).include?(params[:ethnicity][:name]))
---
SELECT "occasions".* FROM "occasions" WHERE "occasions"."name" = ?  [["name", "Dessert"]]
SELECT "ethnicities".* FROM "ethnicities" WHERE "ethnicities"."name" = ?  [["name", "Bear"]]

    #     # @images = Image.all
    #   end
    else
      @images = Image.all.order("created_at DESC").paginate(:page => params[:page], :per_page => 4)
---
SELECT  "images".* FROM "images"  ORDER BY created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "images" WHERE (user_id = 1 AND occasion_id = 1)

  def show
    @image = Image.find_by(id: params[:id])
---
SELECT  "images".* FROM "images" WHERE "images"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @image = current_user.images.build(image_params)
    p "******************************************"
    p @image.image.url
    p "******************************************"
    # respond_to do |format|
      if @image.save
---
INSERT INTO "images" ("description", "occasion_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["description", ""], ["occasion_id", 1], ["user_id", 1], ["created_at", "2016-03-14 23:48:26.988805"], ["updated_at", "2016-03-14 23:48:26.988805"]]

  def destroy
    @image.destroy
---
DELETE FROM "images" WHERE "images"."id" = ?  [["id", 5]]

    def set_image
      @image = Image.find_by(id: params[:id])
---
SELECT "images".* FROM "images" WHERE (user_id = NULL AND occasion_id = 'Dinner')