app/controllers/pins_controller.rb

  def index
    @pins = Pin.all
---
SELECT "pins".* FROM "pins"

  def show
    @pin = Pin.find_by(id: params[:id])
---
SELECT  "pins".* FROM "pins" WHERE "pins"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @pin = current_user.pins.build(pin_params)
    p "******************************************"
    p @pin.image.url
    p "******************************************"
    # respond_to do |format|
      if @pin.save
---
INSERT INTO "pins" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", "testing123"], ["created_at", "2016-02-11 11:22:36.315169"], ["updated_at", "2016-02-11 11:22:36.315169"]]

  def destroy
    @pin.destroy
---
DELETE FROM "pins" WHERE "pins"."id" = ?  [["id", 1]]

    def set_pin
      @pin = Pin.find_by(id: params[:id])
---
SELECT  "pins".* FROM "pins" WHERE "pins"."id" = ? LIMIT 1  [["id", 1]]