app/controllers/products_controller.rb

INSERT INTO "products" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Mascara"], ["created_at", "2016-03-05 00:03:27.259151"], ["updated_at", "2016-03-05 00:03:27.259151"]]
---
	def create
		@product = Product.new(product_params)
		@image = Image.find_or_create_by(params[:image])
		p "HELLO KITTY" * 20
	  if @product.save

SELECT  "images".* FROM "images" WHERE "images"."id" = ? LIMIT 1  [["id", 12]]
---
    def set_image
      @image = Image.find_by(id: params[:id])