app/views/images/_form.html.erb

SELECT "occasions".* FROM "occasions"
---
      <%= f.fields_for :occasion do %>
      <%= f.collection_select :occasion_id, Occasion.all, :id, :name %>