app/views/images/index.html.erb

SELECT "occasions".* FROM "occasions" WHERE "occasions"."name" = ?  [["name", "Dessert"]]
SELECT "ethnicities".* FROM "ethnicities" WHERE "ethnicities"."name" = ?  [["name", "Bear"]]
---
  <form class="filter_form">
    <%= select("occasion", "name", Occasion.all.collect(&:name)) %>
    <%= select("ethnicity", "name", Ethnicity.all.collect(&:name)) %>